IDENTIFICATION DIVISION.
PROGRAM-ID. Simple-Interest.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 PRINCIPAL  PIC 9(5).
  01 RATE       PIC 9V9999.
  01 TIME-YEARS PIC 99.

  01 INTEREST   PIC $ZZZ,ZZ9.99.
  01 INPUT-RATE PIC 99V99.

PROCEDURE DIVISION.
  DISPLAY "ENTER PRINCIPAL: $" WITH NO ADVANCING
  ACCEPT PRINCIPAL.

  DISPLAY "ENTER RATE: %" WITH NO ADVANCING
  ACCEPT INPUT-RATE
  PERFORM CALCULATE-RATE.

  DISPLAY "ENTER TIME (YEARS): " WITH NO ADVANCING
  ACCEPT TIME-YEARS.

  COMPUTE INTEREST = PRINCIPAL * RATE * TIME-YEARS.
  
  DISPLAY "INTEREST: " FUNCTION TRIM(INTEREST)
STOP RUN.

CALCULATE-RATE.
  DIVIDE INPUT-RATE BY 100 GIVING RATE.
