IDENTIFICATION DIVISION.
PROGRAM-ID. IPW.
AUTHOR. PHMM.
DATE-WRITTEN. 09/29/26.

ENVIRONMENT DIVISION.

DATA DIVISION.

PROCEDURE DIVISION.
STOP-RUN.
